src/InformationRegisters/СообщенияПользователям/СообщенияПользователям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияПользователям</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Время</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Срок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важное</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonForms/СообщениеПользователю/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПолучитьСообщения();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияОповещения(Параметры) Экспорт
Ф = ПолучитьФорму("ОбщаяФорма.СообщениеПользователю");
Ф.ОткрытьМодально();	 
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщения()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщенияПользователям.Отправитель КАК Отправитель,
	|	СообщенияПользователям.Получатель КАК Получатель,
	|	СообщенияПользователям.Сообщение КАК Сообщение,
	|	СообщенияПользователям.ТекстСообщения КАК ТекстСообщения,
	|	СообщенияПользователям.Время КАК Время,
	|	СообщенияПользователям.Период КАК Период
	|ИЗ
	|	РегистрСведений.СообщенияПользователям КАК СообщенияПользователям
	|ГДЕ
	|	(СообщенияПользователям.Получатель = &Сотрудник
	|			ИЛИ СообщенияПользователям.Получатель = &ПустойСотрудник)
	|	И СообщенияПользователям.Время <= &ТекущееВремя
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.Сотрудники.ПустаяСсылка());
Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь);
Запрос.УстановитьПараметр("ТекущееВремя", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Отправитель = ВыборкаДетальныеЗаписи.Отправитель; 
	Время = ВыборкаДетальныеЗаписи.Время;
	Сообщение = ВыборкаДетальныеЗаписи.Сообщение;
	ТекстСообщения = ВыборкаДетальныеЗаписи.ТекстСообщения;
		Если Не ВыборкаДетальныеЗаписи.Получатель.Пустая() Тогда
		НаборЗаписей = РегистрыСведений.СообщенияПользователям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.Отправитель.Установить(Отправитель);
		НаборЗаписей.Отбор.Получатель.Установить(ВыборкаДетальныеЗаписи.Получатель);
		НаборЗаписей.Записать();  	
		КонецЕсли;
			Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			Элементы.ФормаСледующееСообщение.Доступность = Ложь;
			КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СледующееСообщение(Команда)
ПолучитьСообщения();
КонецПроцедуры 

&НаСервере
Процедура ОтветитьНаСервере()
ОтветноеСообщение = РегистрыСведений.СообщенияПользователям.СоздатьМенеджерЗаписи();
ОтветноеСообщение.Период = ТекущаяДата();
ОтветноеСообщение.Отправитель = ПараметрыСеанса.Пользователь;
ОтветноеСообщение.Получатель = Отправитель;
ОтветноеСообщение.Сообщение = "Re: "+Сообщение;
ОтветноеСообщение.ТекстСообщения = ТекстОтвета;
ОтветноеСообщение.Время = ТекущаяДата();
ОтветноеСообщение.Срок = 0;
ОтветноеСообщение.Важное = Важное;
ОтветноеСообщение.Записать();
КонецПроцедуры 

&НаКлиенте
Процедура Ответить(Команда) 
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
	Состояние("Передача...",,"Передача сообщения...");
	ОтветитьНаСервере();
	ТекстОтвета = "";
	Иначе
	Сообщить("Напишите текст ответного сообщения!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры
